//index.js
//获取应用实例
const app = getApp()

Page({
  data: {
    markers: [{
      id: 0,
      latitude: 23.1356293269,
      longitude: 113.3562952280,
      width: 30,
      height: 30,
      callout: {
        content: "广州市广软科技有限公司",
        color: "#333",
        anchorX: -50,
        anchorY: -40,
        padding: 10,
        borderRadius: 5,
        bgColor: "#fff",
        arrowLine: true,
        display: "ALWAYS"
      },
    }],
    listD: [{
        id: '1',
        title: "广州环境信息资源共享平台",
        images: '../../images/ziyuangongxiang1.png',
        child: [{
          mark: '系统目标',
          home: true,
          images: '../../images/ziyuangongxiang1.png',
          introText: '以“一大平台、两个中心”作为核心设计理念，其中“一大平台”是指在全面融合各类环保数据资源的基础上，通过大数据、云计算等先进技术手段，构建统一标准、规范的智慧环保大数据服务平台。“两个中心”分别指“环境数据资源中心”、“综合业务办公中心”。 环境数据资源中心实现了数据层面的集成，能够帮助广州市环保局解决数据资源标准规范、来源不统一，数据质量、数据唯一性无法保障、数据资源难以交互共享等问题。综合业务办公中心实现了业务应用层面的集成，可为环保局其他应用系统提供统一的入口，提供便捷的应用导航功能。',
        }]
      }, {
        id: '2',
        title: "广东省固废监管平台",
        images: '../../images/feiwujiancepingtai@2x1.png',
        child: [{
          mark: '系统目标',
          home: true,
          images: '../../images/feiwujiancepingtai@2x1.png',
          introText: '广东省危险废物管理GIS信息管理系统，实现了对广东省危险废物的信息化全过程监管，将传统的人工办理、纸质办理转移至互联网平台，实现了固体废物申报登记的网上申报、危险废物转移计划网上报送、网上转移联单报送与电子联单验证，并设计危险废物转移GPS监管子系统，实现对安装了GPS车载终端的危险废物运输车辆的实时监控，加强了对危险废物运输的动态监管。',
        }]

      },
      {
        id: '3',
        title: "佛山南海区智慧环保",
        images: '../../images/fosahnnanhai.png',
        child: [{
          mark: '系统目标',
          home: true,
          images: '../../images/fosahnnanhai.png',
          introText: '南海环保建设经历了“数字环保”—“智慧环保” —“生态环保”三大阶段，整体系统涵盖环保信息化建设的方方面面，从基础的业务办公，到环境监测和监察，从面向公众的服务到环境应急和环境规划。建成区、镇、 街一体，功能完善，互联互通，覆盖全区的环境信息网络平台。在该平台的基础上，结合佛山市南海区环保局实际业务处理模式和中国政府目前建设“电子政务（外网受理→内网处理→外网发布）”等的要求，实现一套适用于南海区各级环保机构环境管理需要的电子政务综合信息平台和环境保护业务应用平台系统，充分运用各种先进感知技术、网络技术及信息技术构筑“感知测量更透彻，互联互通更可靠，智能应用更深入”的物联网体系，并以此为载体，进一步探索具有南海特色的环保新道路。该项目获得中国地理信息系统银奖工程，环保部示范工程，广东省环境信息化推荐工程，国内的环保行业的信息化领域处于领先水平。',
        }]

      },
      {
        id: '4',
        title: "环境保护技术设备ERP系统",
        images: '../../images/erp.png',
        child: [{
          mark: '系统目标',
          home: true,
          images: '../../images/erp.png',
          introText: '建立在信息技术基础上，集信息技术与先进管理思想于一身，以系统化的管理思想，为企业员工及决策层提供决策手段的管理平台。它是从MRP（物料需求计划）发展而来的新一代集成化管理信息系统，它扩展了MRP的功能，其核心思想是供应链管理。它跳出了传统企业边界，从供应链范围去优化企业的资源，优化了现代企业的运行模式，反映了市场对企业合理调配资源的要求。它对于改善企业业务流程、提高企业核心竞争力具有显著作用ERP系统实际应用中更重要的是应该体现其“管理工具”的本质。ERP系统主要宗旨是对企业所拥有的人、财、物、信息、时间和空间等综合资源进行综合平衡和优化管理，ERP软件协调企业各管理部门，ERP系统围绕市场导向开展业务活动，提高企业的核心竞争力，ERP软件从而取得最好的经济效益。所以，ERP系统首先是一个软件，同时是一个管理工具。ERP软件是IT技术与管理思想的融合体，ERP系统也就是先进的管理思想借助电脑，来达成企业的管理目标。',
        }]

      },
      {
        id: '5',
        title: "青海百灵实验室系统",
        images: '../../images/qinghaibailing.png',
        child: [{
          mark: '系统目标',
          home: true,
          images: '../../images/qinghaibailing.png',
          introText: '生态环境监测管理系统简称生态监测系统，广软的生态监测系统结合lSO/EC17025管理流程及要素，严格遵守实验室能力认可准则、实验室资质认定评审准则和HJ630-2011环境监测质量管理技术导则，全面管控实验室的人、机、料、法、环五大要素。系统利用当前最先进的二维码、云计算、物联网、安全支付等技术实现了生态环境监测业务流程标准化管理、样品全生命周期管理、实验室质控管理、仪器设备一器一档等各类资源统一管理，实现了环境监测全程信息化、实验数据全程可溯化，信息处理完全自动化，同时系统制定一套符合环境检测标准规范的现场采样标准模板、实验室样品分析标准模板、监测报告标准模板，满足第三方检测机构的监测业务和实验室管理工作需求，全面提高实验室工作效率和效能，确保环境监测数据质量。',
        }]

      },
      {
        id: '6',
        title: "新泰市在线监测",
        images: '../../images/xintaizaixianjiance.png',
        child: [{
          mark: '系统目标',
          home: true,
          images: '../../images/xintaizaixianjiance.png',
          introText: '     为了充分贯彻环保理念，遵循国家相关标准和山东省环保厅的标准要求，根据山东省对环境监测的部署要求的实际情况，将现有污染源数据监测数据、大环境空气质量监测数据、视频监控进行整合与统一管理，实现跨平台数据交互、自动采集数据、自动处理及分析数据、自动预警、现场重点区域实际画面、运行安全稳定的环境综合监管平台，实现全天候对山东省新泰市污染源废水和废气、大环境空气质量状态变化的动态监测，以及对污染源废水和废气排放、大环境空气质量的动态监管，为山东省新泰市的环境治理提供科学准确的监测数据，提高环境日常监管能力。通过先进的环保技术,减少生产所造成的污染,提升经济效益和社会效益,在促进可持续发展目标的同时,也可以实现对生态环境保护的目的。 本项目主要的建设任务分成二部分，一是建设污染源自动监控平台运行环境，二是升级补充污染源自动监控综合软件平台，通过构建统一联网的自动监控体系，通过自动化、信息化等技术手段对山东省新泰市污染源监测数据进行日常监控和运营管理，实时地掌握新泰市废水和废气监测数据，使管理者能够及时发现废水和废气排放超标预警，推动废水废气排放的运营维护管理，使工作更加自动化、严密化、规范化，以更加精细和动态的方式实现对污染源的科学管理，大大便捷了管理方法，提高了管理效率。',
        }]

      },
      {
        id: '7',
        title: "山西机动车遥测平台",
        images: '../../images/shanxi.png',
        child: [{
          mark: '系统目标',
          home: true,
          images: '../../images/shanxi.png',
          introText: '为了更好的对在用机动车所排放废气的治理和对机动车环保检测机构的监管，及时发现城市高污染车辆并加以治理，限制外来高污染车进城，减少高排放车辆，降低机动车尾气污染，提高城市环境空气质量。本项目针对机动车尾气污染控制与减排的要求，以“科学的测点布局、严格的数据质控、先进的检测技术”为设计思路，采取“统一规划、统一标准、统一建设和统一运营”建设模式，实现对城市行驶机动车尾气排放的全程管控。结合先进成熟的计算机和网络通信技术，建立一套环保机动车遥感监测数据管理体制以及机动车环境管理综合业务平台，实现机动车监管的自动化、网络化管理，减少人为因素的影响，进而提高检测效率和准确度，为机动车排放控制提供科学依据，以满足管理部门对移动源污染防控和总量减排的需要。',
        }]
      },
      {
        id: '8',
        title: "郯城网格化管理平台",
        images: '../../images/wanggehua.png',
        child: [{
          mark: '系统目标',
          home: true,
          images: '../../images/wanggehua.png',
          introText: '郯城县以加快新旧动能转换为统领，突出新型工业化、新型城镇化“两个重点”，把握经济发展新常态，全县经济继续保持总体平稳、稳中有进的良好态势。随着郯城县经济的快速发展，环保部门的监管工作压力剧增。全县组建了生态环境三级网格员工作队伍，推行了“散乱污”源头防控工作机制，郯城县区、街道乡镇、社区行政村三级 600 多个网格，各级网格监管人员要对辖区内所有排污企业、生态环境、信访案件、污染纠纷、环境安全隐患、违法建设项目、饮用水源地、农村环境综合整治等定期进行排查、巡查和监督，及时发现和制止环境违法行为，并向上级网格和相关部门报告。由于网格涉及工作内容多、具体问题错综复杂、工作量也非常大且全部采用原始手写记录方式，不方便信息的调阅、关联、查询、统计。在有限的资源下，传统的监管模式已无法满足日益增大的工作量，因此，环境网格化监管必须依靠科技手段大力提高环保信息化应用水平，不断提高环境网格化监管水平，为领导决策提供科学数据和有效的环境网格化监管平台。',
        }]
      },
    ]
  },
  onLoad: function() {

  },
  AboutUs() {
    wx.navigateTo({
      url: '../comIntr/comIntr'
    })
  },
  linkServe() {
    wx.navigateTo({
      url: '../service/service'
    })

  },
  linkCom() {
    wx.navigateTo({
      url: '../introduction/introduction'
    })
  },
  openDatail(e) {
    var child = e.currentTarget.dataset.child;
    wx.navigateTo({
      url: '../detail/detail?objCur=' + JSON.stringify(child),
    })
  },
  //右上角分享功能
  onShareAppMessage: function(res) {

  },

})