// pages/servive/servive.js
Page({

  /**
   * 页面的初始数据
   */
  data: {
    list: [{
        id: "0",
        name: "点击收起",
        img: "../../images/huanbao@2x.png",
        title: "智慧环保系统",
        num: 12,
        open: true,
        child: [{
            id: "1-1",
            title: "智慧环保综合解决方案",
            child: [{
              mark: '系统目标',
              images: '../../images/zhihuihuanbao@2x.png',
              introText: '"智慧环保"综合解决方案，充分利用物联网等新一代信息技术以感知为先、传输为基、计算为要、管理为本，构建环境与社会全向互联的 智慧型环保感知网络，率先实现环境监测监控的现代化和智能化，率先实现环保物联网技术的标准化和产业化，率先探索环保物联网系统 建设、运维的市场化和社会化，达到“测得准、传得快、算得清、管得好”的智慧环保总体目标。',
              arrows: [{
                title: '业务协同化',
                content: '将行政许可审批、建设项目管理、环境监督管理、环境 执法、行政处罚、环境信访、环境监测、固废管理、核 与辐射管理、总量管理、生态管理、空气质量预测预 报、环境应急、环境决策等业务进行协调，打通业务之 间的关联，形成协同管理机制。同时将政府的业务工作 和企业的自身管理、公众的环保需求进行统一协同，为 企业、公众提供更好的服务。'
              }, {
                title: '监控一体化',
                content: '建立全方位立体监控网络，对水污染源、气污染源、放 射源、机动车、水环境、大气环境、噪声、土壤、生态 环境等进行全面监控，实现天地空监控一体化智能监控 管理平台。'
              }, {
                title: '资源共享化',
                content: '对跨区域、跨行业及跨平台的环境质量、环境安全和 环境风险信息资源实现共享和科学评价，能够通过模 型和评价体系解决重点城市、区域和流域重大环境管 理问题。'
              }, {
                title: '决策智能化 ',
                content: '随时了解实时的环境质量状况，对某个区域的环境质 量进行预测预报，同时针对环境质量较差的区域落实 限批、停产、关停等环境经济手段准确核算区域环境 资源容载能力，为产业结构调整提供科学依据。'
              }, {
                title: '信息透明化 ',
                content: '通过政务外网网站、企业网上办事大厅及环保APP软件等，构建政 府、企业及公众沟通的桥梁。提供面向排污企业、面向社会、面向百 姓的环境信息服务、实现从原来单一的信息发布窗口和行政审批窗口 到提供数据服务、接受监督、体现互动交流的公众服务平台的转变。'
              }]
            }],
          },
          {
            id: "1-2",
            title: "环境数据资源中心",
            child: [{
              mark: '系统目标',
              images: '../../images/ziyuangongxiang.png',
              introText: '环境数据资源中心依据各类数据标准与规范，通过数据交换、整合、导入、录入等手段，将各类环境信息资源以标准化的方式进行梳理， 形成体系完整、时间跨度长、专业覆盖全面、科学管理的环境信息资源体系，并结合大数据、商务智能、3S、移动互联等技术实现立体实 时展现以及深入挖掘分析，快速灵活的为环保应用决策提供强大的数据服务和信息共享支撑，帮用户随时随地的了解环境质量以及污染排 放的现状和趋势，为实现环境数据整合、信息共享、决策分析提供智慧手段。',
              arrows: [{
                title: '创新移动服务',
                content: '通过将应用服务与移动终端相结合，进行应用的导入， 创新服务模式，让用户随时随地拥有一个专属的、24小 时服务的“随身环保”，做到“信息服务尽情享”。'
              }, {
                title: '数据共享交换',
                content: '建立一个可扩展的、可集成的、有统一数 据模型的、有多种用户视角的、安全可靠 的交换共享平台，对各类环境数据进行整 合、重组，解决数据分散存放、不一致、 难以共享的问题，逐步建立跨部门的、全 方位的、统一的业务协同的信息中心和信 息资源交换中心，实现环境管理从“分散 监管”向“系统监管”转变。'
              }, {
                title: '数据资源标准',
                content: '借鉴国标和相关行业标准的经验，建设和完善相关的数 据标准规范体系，为环境数据资源中心的数据共享与交 换提供技术规范与指导。标准规范包括公共编码规范、 污染源基础数据元规范、数据采集更新规范、数据交换 标准、数据访问接口规范。'
              }, {
                title: 'GIS一张图展示',
                content: '依托电子地图，构建环保决策“一张 图”，通过集合污染源自动监控、污染 源排放分析和环境质量分析等多重功 能，有效解决各系统之间的界限与联 通，体现“建设中有系统，使用时无系 统”的无边界服务建设理念。'
              }, {
                title: '科学决策分析',
                content: '利用数据集市、数据仓库、BI等技术 对数据按照主题、维度进行挖掘分 析，运用数据中心平台输出相应的分 析结果，形成环保业务可视化全景， 提供领导决策应用合力。'
              }]
            }],
          },
          {
            id: "1-3",
            title: "环境感知网格化监测系统",
            child: [{
              mark: '系统目标',
              images: '../../images/wanggehuajiance@2x.png',
              introText: '通过建设网格化环境感知监测体系，面向废气、空气、废水、污水、土壤等多个监测要素，提供“一站式服务”的综合解决方案。根据 属地管理、地理布局、现状管理等原则，将管辖地域划分成若干网格状的单元，运用数字化、信息化的管理模式、对每一网格实施动态 全方位管理。系统以条块融合的网格为载体，深化和完善环境污染防治分级管理的工作体制（级别为省、市、区县、街办、社区），提 升环境管理规范化、精细化、效能化、智能化的水平。',
              arrows: [{
                title: '数据监测',
                content: '及时发现环境污染问题，提升污染防治执法效率效果，加大整体考评力度，为环境污染防治提供可靠的基础数据信息，有效地管控手段，科学的考核管理工具'
              }, {
                title: '实时监测',
                content: '对在全区域内大气污染、环境质量、重点污染源、生态环境等问题、实现从发现、立案、派遣、处置、核查、记录存档的全过程数字化、信息化管理'
              }, {
                title: '网格监督',
                content: '系统为各级网格监督员、环保督查员、环保局监察大队、各协办职能部门分配不同的权限，根据业务流程的要求对各自业务范围内的任务进行处理'
              }, {
                title: '移动平台',
                content: '移动终端查看平台的相关数据，接收任务、上报问题、对案件进行跟踪反馈、核查、结案等工作，充分发挥网格员和网格监督员的作用'
              }]
            }],
          },
          {
            id: "1-4",
            title: "网格化移动执法监管平台",
            child: [{
              mark: '系统目标',
              images: '../../images/wanggeyidongzhifa@2x.png',
              introText: '以“属地管理、分级负责、全面覆盖、责任到人”为原则，依托网格化环境监管平台，将环境监管职责具体落实到由省、市、县（市）区、乡镇（街道）、村居（社居）组成的“横向到边、纵向到底”的网格体系，逐一明确管理、执法、监督等责任，建立污染源动态更新管理机制，建立分类分级处理和及时上报反馈制度，做到执法全覆盖、监管无盲点，全面提升环境监管执法能力，及时发现环境污染问题，力争使大部份环境污染问题在基层得到解决。',
              arrows: [{
                title: '执法管理',
                content: '执法管理包含双随机、环境监察、专项行动、网格化管理以及动态表单配置，可完成现场检查笔录制作、拍照摄像等调查取证工作。'
              }, {
                title: '稽查管理',
                content: '包含日常稽查、专项稽查等，并可实现对人员的稽查考核。'
              }, {
                title: '信访投诉',
                content: '可实现对信访投诉。'
              }, {
                title: '处罚立案',
                content: '实现行政处罚、执法意见、自由裁量、执法建议、案件交接以及后续督查等内容。'
              }, {
                title: '一源一档',
                content: '包含环境管理数据、监督性监测数据、在线监测数据以及环境质量综合管理数据。'
              }, {
                title: '在线监测',
                content: '包含在线监测、视频监控、流量统计以及在线监控污染源统计功能。'
              }, {
                title: '应急处置',
                content: '污染物的相应分析方法、预案库、资源库、危化品库等搜索检查。'
              }]
            }],
          },
          {
            id: "1-5",
            title: "危险废物动态监管平台",
            child: [{
              images: '../../images/feiwujiancepingtai@2x.png',
              introText: '危险废物智能监管系统是一个集物联网、二维码、GPS、RFID、GIS、智能终端、电子联单等技术为一体的危废综合管理平台，实现对危险废物从“摇篮”到“坟墓”的全过程跟踪管理。建设“危废业务外申（申报）内审（审批）外公（公示）模式、移动终端电子联单模式、GPRS监管预警模式”，实现内部智能化管理，转运多手段监控，让危废从最初产生到最终处置的全过程业务流程呈现精细化、实时化的闭环管理，为环保部门真实、细致、及时动态地掌握危废产生、贮存、转移、处置等情况提供有效技术手段，为危废的精细化管理决策提供辅助数据支持，打破业务受理 危废传统管理模式，促进危废管理领域的智能化发展。',
              // arrows: []
            }],
          },
          {
            id: "1-6",
            title: "环境业务协同管理系统",
            child: [{
              mark: '系统目标',
              images: '../../images/yewuxietongguanli@2x.png',
              introText: '环境业务协同管理系统集成审批、监督、许可、执法、排污收费、行政处罚等多个业务系统，采用自主研发的工作流引擎，将环保相关业务分解为任务的形式对业务管理活动进行驱动，便于对业务办理进行跟踪、督办及考核。系统实现污染源从产生开始，将相关信息自动转入后续监管部门共享，并将后续的信息自动归聚到同一污染源，随时反映污染源的动态管理状况，在污染源排污状况与环境质量状况之间建立联系，通过对污染源点源的精细化管理进一步深入到对面源的宏观环境质量改善的管理。',
              arrows: [{
                title: '业务受理',
                content: '业务受理主要包括窗口受理、窗口办结和窗口发文，可将办文窗口的所有相关业务在系统进行集成。'
              }, {
                title: '业务监控',
                content: '业务跟踪：对“三同时”项目、限期整改、限期治理、行政处罚、排污收费等业务进行跟踪事项监控：事项监控主要指对业务办理事宜的监控、对污染源的监控以及对环境质量的监控。'
              }, {
                title: '业务办理',
                content: '业务办理主要集成了统一的任务办理台，并通过任务办理台实了业务的整合流程的整合，建立了全局统一的业务办理平台。'
              }, {
                title: '业务分析',
                content: '业务分析包括对建设项目审批情况、污染源情况、污染物排放情况、许可证情况、排污收费情况、污染源监测情况、环境质量情况、固废转移情况、信访投诉情况、行政处罚情况等的统计分析。'
              }]
            }],
          },
          {
            id: "1-7",
            title: "机动车尾气排放监测与遥测监测监管平台",
            child: [{
              images: '../../images/jidongche@2x.png',
              introText: '机动车尾气排放监控与遥测监管平台以先进成熟的计算机和网络通信技术为主要手段，通过建立一套机动车尾气监测数据管理体制，以统一管理、统一规划、统一标准为原则，对机动车尾气检测全过程进行实时监控，实现机动车排气污染检测的自动化、网络化、即时化和智能化发展需求。系统以机动车环保定期检验为保障，梳理整合机动车排放检测业务流程，建立起较完善的机动车排气污染全生命周期的统一监管平台，加强机动车污染排放控制，推进I/M制度的实施工作。系统可有效遏制检测人员玩忽职守、徇私舞弊等行为，使在用机动车排放控制管理更加科学化、规范化，为机动车排气污染监督管理及污染防治决策提供更加完善的技术支持，全面提高机动车排气污染管理的效率和运行水平，有利于促使汽车维持良好的排放控制水平，加速对高排放车辆的淘汰，控制和削减机动车污染物排放总量，达到抑高纳低、增量减污的目的，可进一步提高机动车污染监控能力、监管水平和监管质量，同时为新车管理、加速高污染车辆的淘汰等重点管理措施提供服务，也为未来的机动车环保决策等提供强有力的技术保障，最终缓解城市机动车快速增长所造成的环境压力和交通压力。',
              // arrows: []
            }],
          },
          {
            id: "1-8",
            title: "环境应急监管平台",
            child: [{
              mark: '系统目标',
              images: '../../images/yingjijianguanpingtai@2x.png',
              introText: '环境应急监管平台是环境应急事件响应指挥中的枢纽，平台结合环境保护行业的特点和应急管理应用需求，率先提出了环境应急业务架构体系。该平台以GIS为核心，全面掌控环境应急事前、事中、事后的全过程，创新融合风险源管理、应急资源管理、数字化预案、应急知识库的日常管理；结合监测预警对风险产生发展全过程的严密监控；将突发事件现场监测监控、智能方案、指挥调度、模型模拟、沙盘推演专家会商、移动应用等手段融于一身，依托各类通讯网络构建的环境应急管理平台。',
              arrows: [{
                  title: '分工协作',
                  content: '双线指挥：后方集中调度，前线统一指挥三级联动：应急中心，现场指挥部，单兵行动四方协同：上级单位，环保体系，职能机构，社会公众'
                },
                {
                  title: '带圈运行',
                  content: '管用分区：信息维护使用不同场景多维展现：展现基于二三维地图RIA应用：采用RIA技术，直观形象'
                },
                {
                  title: '平战结合',
                  content: '信息收集：风险源信息，知识信息丰富完善预防准备：应急资源，网络建设基础坚实监测预警：多元监测手段，风险全面掌握'
                },
                {
                  title: '信息共享',
                  content: '系统集成：综合多方应用，系统整体实现数据整合：容纳多元数据，应急决策保障信息沟通：大屏电脑手持，信息灵活快捷'
                },
                {
                  title: '整体方案',
                  content: '硬件环境：监测监控指挥，硬件全盘考虑通信网络：光纤WIFI卫星，应急通讯保障软件系统：功能灵活丰富，平台整合度高'
                },
                {
                  title: '灵活扩展',
                  content: '模块配置：软件模块化，组合更随心模型接口：模型接口内置，配置展现便捷'
                }
              ]
            }],
          },
          {
            id: "1-9",
            title: "土壤环境质量综合管理系统",
            child: [{
              images: '../../images/turangzongheguanli@2x.png',
              introText: '全面落实《土壤污染防治行动计划》各项要求，以信息化技术手段实现对土壤环境质量监测监控、污染土壤的风险管控、高风险污染土壤的治理与修复，突出重点区域、行业和污染物，实施分类别、分用途、分阶段治理的全过程监管，形成政府主导、企业担责、公众参与、社会监督的土壤污染防治体系。',
              // arrows: []
            }],
          },
          {
            id: "1-10",
            title: "环境监测实验室信息管理系统",
            child: [{
              mark: '系统目标',
              images: '../../images/shiyanshixitong@2x.png',
              introText: '环境监测实验室信息管理系统基于ISO/IEC 17025检测和校准实验室能力认可准则、实验室资质认定评审准则、HJ630-2011环境监测质量管理技术导则的管理思想，实现对实验室人、机、料、法、环的全面管理与控制。系统实现了监测业务流程化管理、样品全生命周期管理、实验室质控管理、仪器设备一器一档、各类资源统一管理等，同时针对环境监测业务工作的特色设置了监测计划、业务管理、报告报表等模块，能够满足各级环境监测站业务和实验室管理工作的需求。系统不仅可以实现过程的信息化，实验室办公无纸化以及实验数据的组织、分析、处理、查询，更重要的是保障对实验过程中的人员、仪器、材料、方法、环境全封闭闭环结构，通过样品追溯、版本控制等活动提高质量控制和质量管理。',
              arrows: [{
                title: '创新监测计划管理',
                content: '把年度监测工作计划(监测大纲)在系统中编制、分解，手工或定时自动下达监测任务并汇总数据编制上报报表，实现监测任务全过程管理。'
              }, {
                title: '监测质量全过程贯穿',
                content: '在编制采样计划、采样、实验室分析过程中，能够添加质控样品。分析结果是否符合质控要求；对各种影响检测质量的状态进行预警或报警。'
              }, {
                title: '监测数据智能审核',
                content: '系统自动计算质控样品的质控结果，如空白样品是否检出、平行样结果精密度、加标回收样品回收率、已知浓度样品分析结果是否超出不确定范围，计算的结果实时反馈给相关责任人。'
              }, {
                title: '移动监测快速发布',
                content: '通过智能终端进行任务接收、现场采样、查询监测对象、填写采样和分析原始记录并打印，利用无线网络进行数据的快速共享、发布。'
              }]
            }],
          },
          {
            id: "1-11",
            title: "污染源动态管控与监管评价管理",
            child: [{
              images: '../../images/wuranyuanjianguan@2x.png',
              introText: '污染源动态管控与监管评价管理系统基于智慧站房的改造提升对监测站房的规范化监管，为保障环境监测数据的真实准确，打击环境监测数据弄虚作假行为，系统将环境在线监测、环境监察执法、污染源企业、环境监测设备仪器、第三方运营等职责及工作流程进行规范，深化整个环境监管系统的工作流环节。实现对监测设备的严格质控，并充分监督第三方运营过程，建立专业化、标准化、正规化的服务管理体系，提升运维管理水平及效率，及时查看和管理每一个环境监测点位的运营状态，为数据准确性及运营管理的及时、有效性监督评价提供有力支撑。',
              // arrows: []
            }],
          },
          {
            id: "1-12",
            title: "智慧园区综合监管平台",
            child: [{
              images: '../../images/zihuiyuanqu@2x.png',
              introText: '针对园区，借助移动互联网、大数据、云计算等现代新技术，着力打造环保“决策一张图、感知一张网、办公一平台”，全面提升园区整体办公、监管、服务、决策应用能力，实现了环境要素全面化、监测手段自动化、预警分析智能化、管理模式创新化、决策指挥科学化。利用云平台、大数据、物联网、空间GIS等技术手段，创建园区图形化风险管理，识别园区排放的典型大气突发环境事件风险物质，掌握区域环境生态风险物质时空分布特点。并建立三维园区、重点企业三维厂区，实现风险精细化管理。围绕园区对环境影响的模拟及预测等关键技术问题，结合现有的环境生态数值预报系统和污染传递扩散理论，建立针对园区典型环境风险物质的突发环境事件预测及模拟技术体系。',
            }],
          },
        ]
      },
      {
        id: "1",
        name: "点击收起",
        img: "../../images/shuiw@2x.png",
        title: "智慧水务系统",
        num: 1,
        open: false,
        child: [{
          title: "智慧水务综合应用管理系统",
          child: [{
            mark: '解决方案',
            images: '../../images/zihuishuiwuzongheyingyong@2x.png',
            introText: '智慧水务涵盖水资源监控与管理、地表水监测与管理、灌区信息化管理、地下水监测与管理、饮用水安全监测与管理、城市内涝监测与预警、城市供排水管理等领域',
            arrows: [{
              title:'智慧水务管理',
              content: '智慧水务管理平台综合运用网络及信息技术，对水雨情、取水量、流量、水位、水质等监测数据及视频监控实行信息化管理，实现供水、排水、防洪防涝、水环境的精细化管理，综合应用于应急指挥和辅助科学决策。'
              },
              {
                title: '内涝监测预警',
                content: '城市内涝监测预警系统实时监测雨量信息、排水管网、泵站及积水点水位信息，与GIS结合，实现对城市内涝的可视化监测并预警。系统结合多种模型，可进行内涝模拟计算，为管网改造、排水管网规划等提供决策支持。'
              },
              {
                title: '地表水监测管理',
                content: '地表水监测管理系统以先进的测报技术和网络技术为支撑实现雨量、水位、水质自动测报, 为中小河流防洪减灾预警预报和水资源合理利用提供可靠的信息支持'
              },
              {
                title: '地下水监测管理',
                content: '地下水监测管理系统自动收集与地下水状态变量有关的信息（如水位、温度、水质等）结合GIS信息，实时掌握地下水动态信息，从而实现地下水资源的实时监管、综合评价和预测决策。'
              },
              {
                title: '水资源智能化',
                content: '水资源智能化监控与管理系统对行政边界断面、水功能区、取水口等进行动态智能监控，并与软硬件平台结合，实现水资源的信息管理、业务管理、调度决策支持、应急指挥支持、纳污防控支持，从而实现对水资源的科学调配和精细化管理。'
              },
              {
                title: '饮用水安全',
                content: '饮用水监测与管理系统运用先进的监测仪器和信息化技术，能够对水源地、制水工艺各个环节，以及输配水管网末梢进行全流程水质检测，并能够将数据自动上传到上级部门进行监管和决策，充分保障保证饮水安全。'
              },
              {
                title: '灌区信息化',
                content: '灌区信息化管理系统采用先进的传感器技术和信息化技术，对灌区水情、墒情、流量和水质等进行自动采集、存储、传输和处理，对泵站和闸门进行自动控制，实现灌区防汛抗旱、水资源的合理调度。'
              },
            ],
          }]
        }, ]
      },
      {
        id: "2",
        name: "点击收起",
        img: "../../images/wulian@2x.png",
        title: "物联感知仪器设备",
        num: 1,
        open: false,
        child: [{
          title: "物联感知仪器设备",
          child: [{
            id: 2 - 1,
            images: '../../images/wulianwangshebei@2x.png',
            introText: '公司建立“生态环境感知 IoT 网络+云平台服务” 。在IoT云平台的基础上，构建丰富的智慧环保、智慧水务应用，包括生态环境监测、污染来源解析、空气质量预报预警、水质预警分析、总量减排评估、网格化布点实时监控等，构建环境与社会全向互联的智慧型生态感知网络，实现环保水务信息化技术的标准化和产业化，探索出环保、水务运营的新型模式,IoT云平台提供构建灵活的、接入无关的，同时面向人与物、物与物的环境感知“连接”到使能“应用”服务能力，充分发挥环境感知物联网的潜在价值。具备很好的开放能力，支持各种环境感知物联网终端设备的快速接入，提供可扩展的设备接入适配服务，有效兼容各类设备，适配物联网采集层设备的具体数据格式和数据交换协议，可完成物联网平台与各类设备的应用层通讯及数据交换；支持各种数据类型接入；通过开放的API接口，能够快速跟现有的系统。'
          }]
        }, ]
      }
    ],
  },

  /**
   * 生命周期函数--监听页面加载
   */
  onLoad: function(options) {

  },

  /**
   * 生命周期函数--监听页面初次渲染完成
   */
  onReady: function() {

  },

  /**
   * 生命周期函数--监听页面显示
   */
  onShow: function() {

  },

  /**
   * 生命周期函数--监听页面隐藏
   */
  onHide: function() {

  },

  /**
   * 生命周期函数--监听页面卸载
   */
  onUnload: function() {

  },

  /**
   * 页面相关事件处理函数--监听用户下拉动作
   */
  onPullDownRefresh: function() {

  },

  /**
   * 页面上拉触底事件的处理函数
   */
  onReachBottom: function() {

  },

  /**
   * 用户点击右上角分享
   */
  onShareAppMessage: function() {

  },


  // 排他
  clickOne(e) {
    var listV = this.data.list;
    var currentid = e.currentTarget.dataset.id;
    for (let i = 0; i < listV.length; i++) {
      if (listV[i].id === currentid) {
        listV[i].open = !listV[i].open;
      } else {
        listV[i].open = false;
      }
    }
    this.setData({
      list: listV
    })
  },
  // 进入页面
  linkTo(e) {
    var child = e.currentTarget.dataset.child;
    wx.navigateTo({
      url: '../detail/detail?objCur=' + JSON.stringify(child),
    })
  },

  backTo() {
    wx.navigateTo({
      url: '../index/index'
    })
  },
})